## Getting and Knowing your Data

#### 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

#### 2. Import the dataset from this address and user_id as index.

In [4]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users_df = pd.read_csv(url, sep='|', index_col='user_id' )
users_df.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

#### 3. What is the number of observations in the dataset?

In [5]:
users_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [6]:
print(users_df.shape)
print("Rows: ",users_df.shape[0])
print("Columns: ", users_df.shape[1])

(943, 4)
Rows:  943
Columns:  4

#### 4. Print the name of all the columns.

In [7]:
users_df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

#### 5. How is the dataset indexed?

In [11]:
users_df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

#### 6. What is the data type of each column?

In [12]:
users_df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

#### 7. Print only occupation column

In [13]:
users_df['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

#### 8. How many different types of occupation are there?

In [14]:
users_df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

#### 9. What is the most frequent occupation?

In [15]:
users_df['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

#### 10. Summarize the dataframe

In [18]:
users_df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

##### 10a. Summarize all the columns

In [19]:
users_df.describe(include="all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

#### 11. What is the mean age of users?

In [20]:
users_df['age'].mean()

34.05196182396607

In [61]:
type_df = chipo_df.astype({'item_price':float})
type_df.item_price.dtype

dtype('float64')

#### 12. What is the age with least occurrence?

In [22]:
users_df['age'].value_counts().tail()
#7, 10, 11, 66 and 73 years -> only 1 occurrence

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64